import Hero from "../../components/common/hero/Hero";
import bg from "../../assets/assets.png";
import HtmlRenderer from "../../components/common/html/HtmlRender";
const PolicyPage = () => {
  const data = `<p>جمع البيانات
نحن نقوم بجمع بعض البيانات الشخصية كجزء من تقديم الخدمات والتفاعل مع موقعنا. قد يتم جمع البيانات مثل الاسم وعنوان البريد الإلكتروني ورقم الهاتف إذا قمتم بتقديمها بشكل طوعي من قبلكم

استخدام البيانات
نستخدم البيانات التي نجمعها لغرض تحسين تجربتكم على موقعنا وتقديم الخدمات المناسبة وفقًا لاحتياجاتكم. قد نستخدم البيانات أيضًا للتواصل معكم بشأن العروض الترويجية أو التحديثات المهمة

حماية البيانات
نحن نتخذ إجراءات أمنية مناسبة لحماية بياناتكم الشخصية من الوصول <h1>غير المصرح به أو الاستخدام غير القانوني</h1> أو التغيير غير المصرح به

ملفات تعريف الارتباط
يتم استخدام ملفات تعريف الارتباط لتحسين تجربتكم على الموقع وتحديد الأنشطة والاهتمامات المفضلة لديكم. لا تستخدم ملفات تعريف الارتباط لجمع البيانات الشخصية بأي شكل من الأشكال

حقوق الزوار
تحت رعاية سياسة الخصوصية، يحق لكم الوصول إلى البيانات الشخصية الخاصة بكم وتحديثها أو حذفه<h4>ا وفقًا لتفضيلاتكم. يمكنكم الاتصا</h4>ل بنا لمزيد من المعلومات حول كيفية ممارسة هذه الحقوق

معلومات الاتصال
إذا كان لديكم أي استفسارات أو مخاوف بشأن سياسة الخصوصية والاستخدام الخاصة بنا، يرجى التواصل معنا عبر البريد الإلكتروني أو الهاتف المحددين في صفحة الاتصال</p>`;
  return (
    <>
      <Hero image={bg} title="سياسة الإفصاح" />
      <div className="container mx-auto px-8 md:px-16 my-5 md:my-8">
        <HtmlRenderer html={data} />
      </div>
    </>
  );
};

export default PolicyPage;
